EDT/ZUP/zup_edt/src/InformationRegisters/МедицинскиеОсмотры/МедицинскиеОсмотры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МедицинскиеОсмотры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатОсмотра</name>
    <type>
      <types>EnumRef.РезультатыМедицинскогоОсмотра</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОсмотра</name>
    <type>
      <types>EnumRef.ТипыМедицинскогоОсмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>DocumentRef.НаправлениеНаМедицинскийОсмотр</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/InformationRegisters/МедицинскиеОсмотры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ГоловнаяОрганизация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РегистрацияФизическихЛиц

Функция РеквизитГоловнаяОрганизация() Экспорт
	Возврат Метаданные.РегистрыСведений.МедицинскиеОсмотры.Измерения.ГоловнаяОрганизация.Имя;
КонецФункции

Функция РеквизитФизическоеЛицо() Экспорт
	Возврат Метаданные.РегистрыСведений.МедицинскиеОсмотры.Измерения.ФизическоеЛицо.Имя;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПередЗаписью(Объект) Экспорт
	
	Объект.ДополнительныеСвойства.Вставить("ТаблицаОбновлениеПериодическихОсмотров", МедицинскиеОсмотры.НоваяТаблицаОбновлениеПериодическихОсмотров());
	ДополнитьТаблицуОбновления(Объект);
	
КонецПроцедуры

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПриЗаписи(Объект) Экспорт
	ДополнитьТаблицуОбновления(Объект);
КонецПроцедуры

Процедура ДополнитьТаблицуОбновления(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Объект.Отбор.Регистратор.Значение);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеНабора.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеНабора.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотры КАК ДанныеНабора
		|ГДЕ
		|	ДанныеНабора.Регистратор = &Регистратор";
	
	ДанныеНабора = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеНабора, Объект.ДополнительныеСвойства["ТаблицаОбновлениеПериодическихОсмотров"]);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
